base/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
#include "../parameters.H"
convertToMeters 1;


vertices
(
   (0 0 0)//0
   (100 0 0)//1
   (100 50 0)//2
   (0 50 0)//3
   (0 0 1)//4
   (100 0 $endChannel)//5
   (100 50 $endChannel)//6
   (0 50 1)//7
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (50 1 20) simpleGrading (1 1 1)

);

edges
(
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0 3 7 4)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (1 2 6 5)

        );
    }
    lowerWall
    {
        type symmetryPlane;
        faces
        (
            (0 1 2 3)
        );
    }
    upperWall
    {
        type wall;
        faces
        (

            (4 7 6 5)
        );
    }
    frontWall
    {
        type empty;
       // neighbourPatch backWall;
        faces
        (
            (0 1 5 4)

        );
    }
    backWall
    {
        type empty;
      //  neighbourPatch frontWall;
        faces
        (
            (3 2 6 7)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
