base/0/U.orig
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
//aveVel 1;
//H 1;
//alpha_ 0;
//slip_factor 0.02;
#include "../parameters.H"

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{

    inlet
    {
        type            fixedProfile;
        profile         polynomial
        (
           ((#calc "3./2.*$aveVel - 3.* $slipFactor/(6.*$slipFactor + 2)" 0 0)        (0 0 0)) //-1/2 U_slip + 3/2 U_avg
           ((#calc "(9.*$slipFactor/(6.*$slipFactor+ 2) - 3./2.*$aveVel)/pow($H,2)" 0 0)	 (2 0 0)) // 3/2(U_slip -U_avg)
        );
	direction        (0 0 1);
        origin           0; // h0 = 1mm
    }

    outlet
    {
        type            zeroGradient;
    }
    upperWall
    {
       #include "../runtimeC++/BJSlipCodedBC.H"

    }
    lowerWall
    {
        type            symmetryPlane;
    }
    frontWall
    {
        type            empty;
    }
    backWall
    {
        type            empty;
    }
}


// ************************************************************************* //
